Helloy1130/STM32/STM32HAL/STM32F407ZGTx/ADS1292R/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define GT_RST_Pin GPIO_PIN_13
#define GT_RST_GPIO_Port GPIOC
#define LED0_Pin GPIO_PIN_9
#define LED0_GPIO_Port GPIOF
#define CT_IIC_SCL_Pin GPIO_PIN_0
#define CT_IIC_SCL_GPIO_Port GPIOB
#define GT_INT_Pin GPIO_PIN_1
#define GT_INT_GPIO_Port GPIOB
#define CT_IIC_SDA_Pin GPIO_PIN_11
#define CT_IIC_SDA_GPIO_Port GPIOF
#define ADS1292R_CS_Pin GPIO_PIN_13
#define ADS1292R_CS_GPIO_Port GPIOF
#define ADS1292R_PWDN_Pin GPIO_PIN_14
#define ADS1292R_PWDN_GPIO_Port GPIOF
#define ADS1292R_START_Pin GPIO_PIN_15
#define ADS1292R_START_GPIO_Port GPIOF
#define ADS1292R_DRDY_Pin GPIO_PIN_0
#define ADS1292R_DRDY_GPIO_Port GPIOG
#define ADS1292R_DRDY_EXTI_IRQn EXTI0_IRQn
#define LCD_BL_Pin GPIO_PIN_15
#define LCD_BL_GPIO_Port GPIOB
#define MY_IIC_SCL_Pin GPIO_PIN_8
#define MY_IIC_SCL_GPIO_Port GPIOB
#define MY_IIC_SDA_Pin GPIO_PIN_9
#define MY_IIC_SDA_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
